7767517
378 475
Input                    in0                      0 1 in0
Split                    splitncnn_0              1 7 in0 1 2 3 4 5 6 7
Input                    in1                      0 1 in1
Split                    splitncnn_1              1 7 in1 9 10 11 12 13 14 15
Input                    in2                      0 1 in2
Concat                   cat_0                    2 1 1 9 17 0=0
Crop                     slice_136                1 1 17 18 -23310=1,1 -23311=1,0 -23309=1,0
BinaryOp                 mul_0                    1 1 18 19 0=2 1=1 2=0.000000e+00
BinaryOp                 add_1                    1 1 19 20 0=0 1=1 2=1.000000e+00
BinaryOp                 mul_2                    2 1 20 in2 21 0=2
Split                    splitncnn_2              1 5 21 22 23 24 25 26
Crop                     slice_137                1 1 7 27 -23310=1,3 -23311=1,0 -23309=1,0
Split                    splitncnn_3              1 2 27 28 29
Crop                     slice_138                1 1 15 30 -23310=1,3 -23311=1,0 -23309=1,0
Split                    splitncnn_4              1 2 30 31 32
Convolution              convrelu_2               1 1 32 33 0=16 1=3 -23310=1,2.000000e-01 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432 9=2
Convolution              convrelu_3               1 1 33 34 0=16 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=2
Convolution              convrelu_4               1 1 34 35 0=16 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=2
Deconvolution            deconv_69                1 1 35 36 0=4 1=4 11=4 12=1 13=2 14=1 18=0 19=0 2=1 3=2 4=1 5=1 6=1024
Split                    splitncnn_5              1 5 36 37 38 39 40 41
Convolution              convrelu_0               1 1 29 42 0=16 1=3 -23310=1,2.000000e-01 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432 9=2
Convolution              convrelu_1               1 1 42 43 0=16 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=2
Convolution              convrelu_5               1 1 43 44 0=16 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=2
Deconvolution            deconv_68                1 1 44 45 0=4 1=4 11=4 12=1 13=2 14=1 18=0 19=0 2=1 3=2 4=1 5=1 6=1024
Split                    splitncnn_6              1 5 45 46 47 48 49 50
Concat                   cat_1                    5 1 28 31 46 37 22 51 0=0
Interp                   upsample_1               1 1 51 52 0=2 1=6.250000e-02 2=6.250000e-02 6=0
MemoryData               block0.convblock.0       0 1 53 0=1 1=1 2=192
Convolution              convrelu_6               1 1 52 54 0=96 1=3 -23310=1,2.000000e-01 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=12960 9=2
Convolution              convrelu_7               1 1 54 55 0=192 1=3 -23310=1,2.000000e-01 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=165888 9=2
Split                    splitncnn_7              1 2 55 56 57
Convolution              conv_20                  1 1 57 58 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
BinaryOp                 mul_3                    2 1 58 53 59 0=2
BinaryOp                 add_4                    2 1 59 56 60 0=0
MemoryData               block0.convblock.1       0 1 61 0=1 1=1 2=192
ReLU                     leakyrelu_83             1 1 60 62 0=2.000000e-01
Split                    splitncnn_8              1 2 62 63 64
Convolution              conv_21                  1 1 64 65 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
BinaryOp                 mul_5                    2 1 65 61 66 0=2
BinaryOp                 add_6                    2 1 66 63 67 0=0
MemoryData               block0.convblock.2       0 1 68 0=1 1=1 2=192
ReLU                     leakyrelu_84             1 1 67 69 0=2.000000e-01
Split                    splitncnn_9              1 2 69 70 71
Convolution              conv_22                  1 1 71 72 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
BinaryOp                 mul_7                    2 1 72 68 73 0=2
BinaryOp                 add_8                    2 1 73 70 74 0=0
MemoryData               block0.convblock.3       0 1 75 0=1 1=1 2=192
ReLU                     leakyrelu_85             1 1 74 76 0=2.000000e-01
Split                    splitncnn_10             1 2 76 77 78
Convolution              conv_23                  1 1 78 79 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
BinaryOp                 mul_9                    2 1 79 75 80 0=2
BinaryOp                 add_10                   2 1 80 77 81 0=0
MemoryData               block0.convblock.4       0 1 82 0=1 1=1 2=192
ReLU                     leakyrelu_86             1 1 81 83 0=2.000000e-01
Split                    splitncnn_11             1 2 83 84 85
Convolution              conv_24                  1 1 85 86 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
BinaryOp                 mul_11                   2 1 86 82 87 0=2
BinaryOp                 add_12                   2 1 87 84 88 0=0
MemoryData               block0.convblock.5       0 1 89 0=1 1=1 2=192
ReLU                     leakyrelu_87             1 1 88 90 0=2.000000e-01
Split                    splitncnn_12             1 2 90 91 92
Convolution              conv_25                  1 1 92 93 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
BinaryOp                 mul_13                   2 1 93 89 94 0=2
BinaryOp                 add_14                   2 1 94 91 95 0=0
MemoryData               block0.convblock.6       0 1 96 0=1 1=1 2=192
ReLU                     leakyrelu_88             1 1 95 97 0=2.000000e-01
Split                    splitncnn_13             1 2 97 98 99
Convolution              conv_26                  1 1 99 100 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
BinaryOp                 mul_15                   2 1 100 96 101 0=2
BinaryOp                 add_16                   2 1 101 98 102 0=0
MemoryData               block0.convblock.7       0 1 103 0=1 1=1 2=192
ReLU                     leakyrelu_89             1 1 102 104 0=2.000000e-01
Split                    splitncnn_14             1 2 104 105 106
Convolution              conv_27                  1 1 106 107 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
BinaryOp                 mul_17                   2 1 107 103 108 0=2
BinaryOp                 add_18                   2 1 108 105 109 0=0
ReLU                     leakyrelu_90             1 1 109 110 0=2.000000e-01
Deconvolution            deconv_70                1 1 110 111 0=52 1=4 11=4 12=1 13=2 14=1 18=0 19=0 2=1 3=2 4=1 5=1 6=159744
PixelShuffle             pixelshuffle_131         1 1 111 112 0=2 1=0
Interp                   upsample_2               1 1 112 113 0=2 1=1.600000e+01 2=1.600000e+01 6=0
Slice                    tensor_split_0           1 3 113 114 115 116 -23300=3,4,1,-233 1=0
BinaryOp                 mul_19                   1 1 114 117 0=2 1=1 2=1.600000e+01
Split                    splitncnn_15             1 6 117 118 119 120 121 122 123
Crop                     slice_139                1 1 123 124 -23310=1,2 -23311=1,0 -23309=1,0
rife.Warp                 warp_20                   2 1 2 124 125 0=6
Crop                     slice_140                1 1 122 126 -23310=1,4 -23311=1,0 -23309=1,2
rife.Warp                 warp_21                   2 1 10 126 127 0=6
Crop                     slice_141                1 1 121 128 -23310=1,2 -23311=1,0 -23309=1,0
rife.Warp                 warp_22                   2 1 47 128 129 0=6
Crop                     slice_142                1 1 120 130 -23310=1,4 -23311=1,0 -23309=1,2
rife.Warp                 warp_23                   2 1 38 130 131 0=6
Interp                   upsample_3               1 1 119 132 0=2 1=1.250000e-01 2=1.250000e-01 6=0
BinaryOp                 div_24                   1 1 132 133 0=3 1=1 2=8.000000e+00
Crop                     slice_144                1 1 127 134 -23310=1,3 -23311=1,0 -23309=1,0
Crop                     slice_143                1 1 125 135 -23310=1,3 -23311=1,0 -23309=1,0
Concat                   cat_2                    7 1 135 134 129 131 23 115 116 136 0=0
Interp                   upsample_4               1 1 136 137 0=2 1=1.250000e-01 2=1.250000e-01 6=0
Concat                   cat_3                    2 1 137 133 138 0=0
MemoryData               block1.convblock.0       0 1 139 0=1 1=1 2=128
Convolution              convrelu_8               1 1 138 140 0=64 1=3 -23310=1,2.000000e-01 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=16128 9=2
Convolution              convrelu_9               1 1 140 141 0=128 1=3 -23310=1,2.000000e-01 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=73728 9=2
Split                    splitncnn_16             1 2 141 142 143
Convolution              conv_30                  1 1 143 144 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
BinaryOp                 mul_25                   2 1 144 139 145 0=2
BinaryOp                 add_26                   2 1 145 142 146 0=0
MemoryData               block1.convblock.1       0 1 147 0=1 1=1 2=128
ReLU                     leakyrelu_93             1 1 146 148 0=2.000000e-01
Split                    splitncnn_17             1 2 148 149 150
Convolution              conv_31                  1 1 150 151 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
BinaryOp                 mul_27                   2 1 151 147 152 0=2
BinaryOp                 add_28                   2 1 152 149 153 0=0
MemoryData               block1.convblock.2       0 1 154 0=1 1=1 2=128
ReLU                     leakyrelu_94             1 1 153 155 0=2.000000e-01
Split                    splitncnn_18             1 2 155 156 157
Convolution              conv_32                  1 1 157 158 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
BinaryOp                 mul_29                   2 1 158 154 159 0=2
BinaryOp                 add_30                   2 1 159 156 160 0=0
MemoryData               block1.convblock.3       0 1 161 0=1 1=1 2=128
ReLU                     leakyrelu_95             1 1 160 162 0=2.000000e-01
Split                    splitncnn_19             1 2 162 163 164
Convolution              conv_33                  1 1 164 165 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
BinaryOp                 mul_31                   2 1 165 161 166 0=2
BinaryOp                 add_32                   2 1 166 163 167 0=0
MemoryData               block1.convblock.4       0 1 168 0=1 1=1 2=128
ReLU                     leakyrelu_96             1 1 167 169 0=2.000000e-01
Split                    splitncnn_20             1 2 169 170 171
Convolution              conv_34                  1 1 171 172 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
BinaryOp                 mul_33                   2 1 172 168 173 0=2
BinaryOp                 add_34                   2 1 173 170 174 0=0
MemoryData               block1.convblock.5       0 1 175 0=1 1=1 2=128
ReLU                     leakyrelu_97             1 1 174 176 0=2.000000e-01
Split                    splitncnn_21             1 2 176 177 178
Convolution              conv_35                  1 1 178 179 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
BinaryOp                 mul_35                   2 1 179 175 180 0=2
BinaryOp                 add_36                   2 1 180 177 181 0=0
MemoryData               block1.convblock.6       0 1 182 0=1 1=1 2=128
ReLU                     leakyrelu_98             1 1 181 183 0=2.000000e-01
Split                    splitncnn_22             1 2 183 184 185
Convolution              conv_36                  1 1 185 186 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
BinaryOp                 mul_37                   2 1 186 182 187 0=2
BinaryOp                 add_38                   2 1 187 184 188 0=0
MemoryData               block1.convblock.7       0 1 189 0=1 1=1 2=128
ReLU                     leakyrelu_99             1 1 188 190 0=2.000000e-01
Split                    splitncnn_23             1 2 190 191 192
Convolution              conv_37                  1 1 192 193 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
BinaryOp                 mul_39                   2 1 193 189 194 0=2
BinaryOp                 add_40                   2 1 194 191 195 0=0
ReLU                     leakyrelu_100            1 1 195 196 0=2.000000e-01
Deconvolution            deconv_71                1 1 196 197 0=52 1=4 11=4 12=1 13=2 14=1 18=0 19=0 2=1 3=2 4=1 5=1 6=106496
PixelShuffle             pixelshuffle_132         1 1 197 198 0=2 1=0
Interp                   upsample_5               1 1 198 199 0=2 1=8.000000e+00 2=8.000000e+00 6=0
Slice                    tensor_split_1           1 3 199 200 201 202 -23300=3,4,1,-233 1=0
BinaryOp                 mul_41                   1 1 200 203 0=2 1=1 2=8.000000e+00
BinaryOp                 add_42                   2 1 118 203 204 0=0
Split                    splitncnn_24             1 6 204 205 206 207 208 209 210
Crop                     slice_145                1 1 210 211 -23310=1,2 -23311=1,0 -23309=1,0
rife.Warp                 warp_43                   2 1 3 211 212 0=6
Crop                     slice_146                1 1 209 213 -23310=1,4 -23311=1,0 -23309=1,2
rife.Warp                 warp_44                   2 1 11 213 214 0=6
Crop                     slice_147                1 1 208 215 -23310=1,2 -23311=1,0 -23309=1,0
rife.Warp                 warp_45                   2 1 48 215 216 0=6
Crop                     slice_148                1 1 207 217 -23310=1,4 -23311=1,0 -23309=1,2
rife.Warp                 warp_46                   2 1 39 217 218 0=6
Interp                   upsample_6               1 1 206 219 0=2 1=2.500000e-01 2=2.500000e-01 6=0
BinaryOp                 div_47                   1 1 219 220 0=3 1=1 2=4.000000e+00
Crop                     slice_150                1 1 214 221 -23310=1,3 -23311=1,0 -23309=1,0
Crop                     slice_149                1 1 212 222 -23310=1,3 -23311=1,0 -23309=1,0
Concat                   cat_4                    7 1 222 221 216 218 24 201 202 223 0=0
Interp                   upsample_7               1 1 223 224 0=2 1=2.500000e-01 2=2.500000e-01 6=0
Concat                   cat_5                    2 1 224 220 225 0=0
MemoryData               block2.convblock.0       0 1 226 0=1 1=1 2=96
Convolution              convrelu_10              1 1 225 227 0=48 1=3 -23310=1,2.000000e-01 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=12096 9=2
Convolution              convrelu_11              1 1 227 228 0=96 1=3 -23310=1,2.000000e-01 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=41472 9=2
Split                    splitncnn_25             1 2 228 229 230
Convolution              conv_40                  1 1 230 231 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
BinaryOp                 mul_48                   2 1 231 226 232 0=2
BinaryOp                 add_49                   2 1 232 229 233 0=0
MemoryData               block2.convblock.1       0 1 234 0=1 1=1 2=96
ReLU                     leakyrelu_103            1 1 233 235 0=2.000000e-01
Split                    splitncnn_26             1 2 235 236 237
Convolution              conv_41                  1 1 237 238 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
BinaryOp                 mul_50                   2 1 238 234 239 0=2
BinaryOp                 add_51                   2 1 239 236 240 0=0
MemoryData               block2.convblock.2       0 1 241 0=1 1=1 2=96
ReLU                     leakyrelu_104            1 1 240 242 0=2.000000e-01
Split                    splitncnn_27             1 2 242 243 244
Convolution              conv_42                  1 1 244 245 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
BinaryOp                 mul_52                   2 1 245 241 246 0=2
BinaryOp                 add_53                   2 1 246 243 247 0=0
MemoryData               block2.convblock.3       0 1 248 0=1 1=1 2=96
ReLU                     leakyrelu_105            1 1 247 249 0=2.000000e-01
Split                    splitncnn_28             1 2 249 250 251
Convolution              conv_43                  1 1 251 252 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
BinaryOp                 mul_54                   2 1 252 248 253 0=2
BinaryOp                 add_55                   2 1 253 250 254 0=0
MemoryData               block2.convblock.4       0 1 255 0=1 1=1 2=96
ReLU                     leakyrelu_106            1 1 254 256 0=2.000000e-01
Split                    splitncnn_29             1 2 256 257 258
Convolution              conv_44                  1 1 258 259 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
BinaryOp                 mul_56                   2 1 259 255 260 0=2
BinaryOp                 add_57                   2 1 260 257 261 0=0
MemoryData               block2.convblock.5       0 1 262 0=1 1=1 2=96
ReLU                     leakyrelu_107            1 1 261 263 0=2.000000e-01
Split                    splitncnn_30             1 2 263 264 265
Convolution              conv_45                  1 1 265 266 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
BinaryOp                 mul_58                   2 1 266 262 267 0=2
BinaryOp                 add_59                   2 1 267 264 268 0=0
MemoryData               block2.convblock.6       0 1 269 0=1 1=1 2=96
ReLU                     leakyrelu_108            1 1 268 270 0=2.000000e-01
Split                    splitncnn_31             1 2 270 271 272
Convolution              conv_46                  1 1 272 273 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
BinaryOp                 mul_60                   2 1 273 269 274 0=2
BinaryOp                 add_61                   2 1 274 271 275 0=0
MemoryData               block2.convblock.7       0 1 276 0=1 1=1 2=96
ReLU                     leakyrelu_109            1 1 275 277 0=2.000000e-01
Split                    splitncnn_32             1 2 277 278 279
Convolution              conv_47                  1 1 279 280 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
BinaryOp                 mul_62                   2 1 280 276 281 0=2
BinaryOp                 add_63                   2 1 281 278 282 0=0
ReLU                     leakyrelu_110            1 1 282 283 0=2.000000e-01
Deconvolution            deconv_72                1 1 283 284 0=52 1=4 11=4 12=1 13=2 14=1 18=0 19=0 2=1 3=2 4=1 5=1 6=79872
PixelShuffle             pixelshuffle_133         1 1 284 285 0=2 1=0
Interp                   upsample_8               1 1 285 286 0=2 1=4.000000e+00 2=4.000000e+00 6=0
Slice                    tensor_split_2           1 3 286 287 288 289 -23300=3,4,1,-233 1=0
BinaryOp                 mul_64                   1 1 287 290 0=2 1=1 2=4.000000e+00
BinaryOp                 add_65                   2 1 205 290 291 0=0
Split                    splitncnn_33             1 6 291 292 293 294 295 296 297
Crop                     slice_151                1 1 297 298 -23310=1,2 -23311=1,0 -23309=1,0
rife.Warp                 warp_66                   2 1 4 298 299 0=6
Crop                     slice_152                1 1 296 300 -23310=1,4 -23311=1,0 -23309=1,2
rife.Warp                 warp_67                   2 1 12 300 301 0=6
Crop                     slice_153                1 1 295 302 -23310=1,2 -23311=1,0 -23309=1,0
rife.Warp                 warp_68                   2 1 49 302 303 0=6
Crop                     slice_154                1 1 294 304 -23310=1,4 -23311=1,0 -23309=1,2
rife.Warp                 warp_69                   2 1 40 304 305 0=6
Interp                   upsample_9               1 1 293 306 0=2 1=5.000000e-01 2=5.000000e-01 6=0
BinaryOp                 div_70                   1 1 306 307 0=3 1=1 2=2.000000e+00
Crop                     slice_156                1 1 301 308 -23310=1,3 -23311=1,0 -23309=1,0
Crop                     slice_155                1 1 299 309 -23310=1,3 -23311=1,0 -23309=1,0
Concat                   cat_6                    7 1 309 308 303 305 25 288 289 310 0=0
Interp                   upsample_10              1 1 310 311 0=2 1=5.000000e-01 2=5.000000e-01 6=0
Concat                   cat_7                    2 1 311 307 312 0=0
MemoryData               block3.convblock.0       0 1 313 0=1 1=1 2=64
Convolution              convrelu_12              1 1 312 314 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=8064 9=2
Convolution              convrelu_13              1 1 314 315 0=64 1=3 -23310=1,2.000000e-01 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=18432 9=2
Split                    splitncnn_34             1 2 315 316 317
Convolution              conv_50                  1 1 317 318 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
BinaryOp                 mul_71                   2 1 318 313 319 0=2
BinaryOp                 add_72                   2 1 319 316 320 0=0
MemoryData               block3.convblock.1       0 1 321 0=1 1=1 2=64
ReLU                     leakyrelu_113            1 1 320 322 0=2.000000e-01
Split                    splitncnn_35             1 2 322 323 324
Convolution              conv_51                  1 1 324 325 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
BinaryOp                 mul_73                   2 1 325 321 326 0=2
BinaryOp                 add_74                   2 1 326 323 327 0=0
MemoryData               block3.convblock.2       0 1 328 0=1 1=1 2=64
ReLU                     leakyrelu_114            1 1 327 329 0=2.000000e-01
Split                    splitncnn_36             1 2 329 330 331
Convolution              conv_52                  1 1 331 332 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
BinaryOp                 mul_75                   2 1 332 328 333 0=2
BinaryOp                 add_76                   2 1 333 330 334 0=0
MemoryData               block3.convblock.3       0 1 335 0=1 1=1 2=64
ReLU                     leakyrelu_115            1 1 334 336 0=2.000000e-01
Split                    splitncnn_37             1 2 336 337 338
Convolution              conv_53                  1 1 338 339 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
BinaryOp                 mul_77                   2 1 339 335 340 0=2
BinaryOp                 add_78                   2 1 340 337 341 0=0
MemoryData               block3.convblock.4       0 1 342 0=1 1=1 2=64
ReLU                     leakyrelu_116            1 1 341 343 0=2.000000e-01
Split                    splitncnn_38             1 2 343 344 345
Convolution              conv_54                  1 1 345 346 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
BinaryOp                 mul_79                   2 1 346 342 347 0=2
BinaryOp                 add_80                   2 1 347 344 348 0=0
MemoryData               block3.convblock.5       0 1 349 0=1 1=1 2=64
ReLU                     leakyrelu_117            1 1 348 350 0=2.000000e-01
Split                    splitncnn_39             1 2 350 351 352
Convolution              conv_55                  1 1 352 353 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
BinaryOp                 mul_81                   2 1 353 349 354 0=2
BinaryOp                 add_82                   2 1 354 351 355 0=0
MemoryData               block3.convblock.6       0 1 356 0=1 1=1 2=64
ReLU                     leakyrelu_118            1 1 355 357 0=2.000000e-01
Split                    splitncnn_40             1 2 357 358 359
Convolution              conv_56                  1 1 359 360 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
BinaryOp                 mul_83                   2 1 360 356 361 0=2
BinaryOp                 add_84                   2 1 361 358 362 0=0
MemoryData               block3.convblock.7       0 1 363 0=1 1=1 2=64
ReLU                     leakyrelu_119            1 1 362 364 0=2.000000e-01
Split                    splitncnn_41             1 2 364 365 366
Convolution              conv_57                  1 1 366 367 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
BinaryOp                 mul_85                   2 1 367 363 368 0=2
BinaryOp                 add_86                   2 1 368 365 369 0=0
ReLU                     leakyrelu_120            1 1 369 370 0=2.000000e-01
Deconvolution            deconv_73                1 1 370 371 0=52 1=4 11=4 12=1 13=2 14=1 18=0 19=0 2=1 3=2 4=1 5=1 6=53248
PixelShuffle             pixelshuffle_134         1 1 371 372 0=2 1=0
Interp                   upsample_11              1 1 372 373 0=2 1=2.000000e+00 2=2.000000e+00 6=0
Slice                    tensor_split_3           1 3 373 374 375 376 -23300=3,4,1,-233 1=0
BinaryOp                 mul_87                   1 1 374 377 0=2 1=1 2=2.000000e+00
BinaryOp                 add_88                   2 1 292 377 378 0=0
Split                    splitncnn_42             1 6 378 379 380 381 382 383 384
Crop                     slice_157                1 1 384 385 -23310=1,2 -23311=1,0 -23309=1,0
rife.Warp                 warp_89                   2 1 5 385 386 0=6
Crop                     slice_158                1 1 383 387 -23310=1,4 -23311=1,0 -23309=1,2
rife.Warp                 warp_90                   2 1 13 387 388 0=6
Crop                     slice_159                1 1 382 389 -23310=1,2 -23311=1,0 -23309=1,0
rife.Warp                 warp_91                   2 1 50 389 390 0=6
Crop                     slice_160                1 1 381 391 -23310=1,4 -23311=1,0 -23309=1,2
rife.Warp                 warp_92                   2 1 41 391 392 0=6
Crop                     slice_162                1 1 388 393 -23310=1,3 -23311=1,0 -23309=1,0
Crop                     slice_161                1 1 386 394 -23310=1,3 -23311=1,0 -23309=1,0
Concat                   cat_8                    7 1 394 393 390 392 26 375 376 395 0=0
Concat                   cat_9                    2 1 395 379 396 0=0
MemoryData               block4.convblock.0       0 1 397 0=1 1=1 2=32
Convolution              convrelu_14              1 1 396 398 0=16 1=3 -23310=1,2.000000e-01 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=4032 9=2
Convolution              convrelu_15              1 1 398 399 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=4608 9=2
Split                    splitncnn_43             1 2 399 400 401
Convolution              conv_60                  1 1 401 402 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
BinaryOp                 mul_93                   2 1 402 397 403 0=2
BinaryOp                 add_94                   2 1 403 400 404 0=0
MemoryData               block4.convblock.1       0 1 405 0=1 1=1 2=32
ReLU                     leakyrelu_123            1 1 404 406 0=2.000000e-01
Split                    splitncnn_44             1 2 406 407 408
Convolution              conv_61                  1 1 408 409 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
BinaryOp                 mul_95                   2 1 409 405 410 0=2
BinaryOp                 add_96                   2 1 410 407 411 0=0
MemoryData               block4.convblock.2       0 1 412 0=1 1=1 2=32
ReLU                     leakyrelu_124            1 1 411 413 0=2.000000e-01
Split                    splitncnn_45             1 2 413 414 415
Convolution              conv_62                  1 1 415 416 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
BinaryOp                 mul_97                   2 1 416 412 417 0=2
BinaryOp                 add_98                   2 1 417 414 418 0=0
MemoryData               block4.convblock.3       0 1 419 0=1 1=1 2=32
ReLU                     leakyrelu_125            1 1 418 420 0=2.000000e-01
Split                    splitncnn_46             1 2 420 421 422
Convolution              conv_63                  1 1 422 423 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
BinaryOp                 mul_99                   2 1 423 419 424 0=2
BinaryOp                 add_100                  2 1 424 421 425 0=0
MemoryData               block4.convblock.4       0 1 426 0=1 1=1 2=32
ReLU                     leakyrelu_126            1 1 425 427 0=2.000000e-01
Split                    splitncnn_47             1 2 427 428 429
Convolution              conv_64                  1 1 429 430 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
BinaryOp                 mul_101                  2 1 430 426 431 0=2
BinaryOp                 add_102                  2 1 431 428 432 0=0
MemoryData               block4.convblock.5       0 1 433 0=1 1=1 2=32
ReLU                     leakyrelu_127            1 1 432 434 0=2.000000e-01
Split                    splitncnn_48             1 2 434 435 436
Convolution              conv_65                  1 1 436 437 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
BinaryOp                 mul_103                  2 1 437 433 438 0=2
BinaryOp                 add_104                  2 1 438 435 439 0=0
MemoryData               block4.convblock.6       0 1 440 0=1 1=1 2=32
ReLU                     leakyrelu_128            1 1 439 441 0=2.000000e-01
Split                    splitncnn_49             1 2 441 442 443
Convolution              conv_66                  1 1 443 444 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
BinaryOp                 mul_105                  2 1 444 440 445 0=2
BinaryOp                 add_106                  2 1 445 442 446 0=0
MemoryData               block4.convblock.7       0 1 447 0=1 1=1 2=32
ReLU                     leakyrelu_129            1 1 446 448 0=2.000000e-01
Split                    splitncnn_50             1 2 448 449 450
Convolution              conv_67                  1 1 450 451 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
BinaryOp                 mul_107                  2 1 451 447 452 0=2
BinaryOp                 add_108                  2 1 452 449 453 0=0
ReLU                     leakyrelu_130            1 1 453 454 0=2.000000e-01
Deconvolution            deconv_74                1 1 454 455 0=52 1=4 11=4 12=1 13=2 14=1 18=0 19=0 2=1 3=2 4=1 5=1 6=26624
PixelShuffle             pixelshuffle_135         1 1 455 456 0=2 1=0
Split                    splitncnn_51             1 2 456 457 458
Crop                     slice_163                1 1 458 459 -23310=1,4 -23311=1,0 -23309=1,0
BinaryOp                 add_109                  2 1 380 459 460 0=0
Split                    splitncnn_52             1 2 460 461 462
Crop                     slice_164                1 1 457 463 -23310=1,5 -23311=1,0 -23309=1,4
Sigmoid                  sigmoid_0                1 1 463 464
Split                    splitncnn_53             1 2 464 465 466
BinaryOp                 sub_110                  1 1 465 467 0=7 1=1 2=1.000000e+00
Crop                     slice_165                1 1 462 468 -23310=1,4 -23311=1,0 -23309=1,2
rife.Warp                 warp_111                  2 1 14 468 469 0=6
BinaryOp                 mul_112                  2 1 469 467 470 0=2
Crop                     slice_166                1 1 461 471 -23310=1,2 -23311=1,0 -23309=1,0
rife.Warp                 warp_113                  2 1 6 471 472 0=6
BinaryOp                 mul_114                  2 1 472 466 473 0=2
BinaryOp                 add_115                  2 1 473 470 out0 0=0
