7767517
166 199
Input                    in0                      0 1 in0
Split                    splitncnn_0              1 5 in0 1 2 3 4 5
Input                    in1                      0 1 in1
Split                    splitncnn_1              1 5 in1 7 8 9 10 11
Input                    in2                      0 1 in2
Split                    splitncnn_2              1 4 in2 13 14 15 16
Concat                   cat_0                    3 1 1 7 13 17
Interp                   upsample_9               1 1 17 18 0=2 1=1.250000e-01 2=1.250000e-01
Convolution              conv_20                  1 1 18 19 0=96 1=3 3=2 4=1 5=1 6=6048
PReLU                    prelu_64                 1 1 19 20 0=96
Convolution              conv_21                  1 1 20 21 0=192 1=3 3=2 4=1 5=1 6=165888
PReLU                    prelu_65                 1 1 21 22 0=192
Split                    splitncnn_3              1 2 22 23 24
Convolution              conv_22                  1 1 24 25 0=192 1=3 4=1 5=1 6=331776
PReLU                    prelu_66                 1 1 25 26 0=192
Convolution              conv_23                  1 1 26 27 0=192 1=3 4=1 5=1 6=331776
PReLU                    prelu_67                 1 1 27 28 0=192
Convolution              conv_24                  1 1 28 29 0=192 1=3 4=1 5=1 6=331776
PReLU                    prelu_68                 1 1 29 30 0=192
Convolution              conv_25                  1 1 30 31 0=192 1=3 4=1 5=1 6=331776
PReLU                    prelu_69                 1 1 31 32 0=192
Convolution              conv_26                  1 1 32 33 0=192 1=3 4=1 5=1 6=331776
PReLU                    prelu_70                 1 1 33 34 0=192
Convolution              conv_27                  1 1 34 35 0=192 1=3 4=1 5=1 6=331776
PReLU                    prelu_71                 1 1 35 36 0=192
Convolution              conv_28                  1 1 36 37 0=192 1=3 4=1 5=1 6=331776
PReLU                    prelu_72                 1 1 37 38 0=192
Convolution              conv_29                  1 1 38 39 0=192 1=3 4=1 5=1 6=331776
PReLU                    prelu_73                 1 1 39 40 0=192
BinaryOp                 add_0                    2 1 40 23 41
Deconvolution            deconv_60                1 1 41 flow0 0=5 1=4 3=2 4=1 5=1 6=15360
Interp                   upsample_10              1 1 flow0 43 0=2 1=1.600000e+01 2=1.600000e+01
Split                    splitncnn_4              1 2 43 44 45
Crop                     slice_104                1 1 45 46 -23309=1,0 -23310=1,4 -23311=1,0
BinaryOp                 mul_1                    1 1 46 47 0=2 1=1 2=1.600000e+01
Split                    splitncnn_5              1 4 47 48 49 50 51
Interp                   upsample_11              1 1 49 52 0=2 1=2.500000e-01 2=2.500000e-01
BinaryOp                 mul_2                    1 1 52 53 0=2 1=1 2=2.500000e-01
Crop                     slice_105                1 1 51 54 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                warp_1                   2 1 11 54 55
Crop                     slice_106                1 1 50 56 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                warp_0                   2 1 5 56 57
Crop                     slice_107                1 1 44 58 -23309=1,4 -23310=1,5 -23311=1,0
Split                    splitncnn_6              1 2 58 59 60
Concat                   cat_1                    4 1 57 55 14 59 61
Interp                   upsample_12              1 1 61 62 0=2 1=2.500000e-01 2=2.500000e-01
Concat                   cat_2                    2 1 62 53 63
Convolution              conv_30                  1 1 63 64 0=64 1=3 3=2 4=1 5=1 6=6912
PReLU                    prelu_74                 1 1 64 65 0=64
Convolution              conv_31                  1 1 65 66 0=128 1=3 3=2 4=1 5=1 6=73728
PReLU                    prelu_75                 1 1 66 67 0=128
Split                    splitncnn_7              1 2 67 68 69
Convolution              conv_32                  1 1 69 70 0=128 1=3 4=1 5=1 6=147456
PReLU                    prelu_76                 1 1 70 71 0=128
Convolution              conv_33                  1 1 71 72 0=128 1=3 4=1 5=1 6=147456
PReLU                    prelu_77                 1 1 72 73 0=128
Convolution              conv_34                  1 1 73 74 0=128 1=3 4=1 5=1 6=147456
PReLU                    prelu_78                 1 1 74 75 0=128
Convolution              conv_35                  1 1 75 76 0=128 1=3 4=1 5=1 6=147456
PReLU                    prelu_79                 1 1 76 77 0=128
Convolution              conv_36                  1 1 77 78 0=128 1=3 4=1 5=1 6=147456
PReLU                    prelu_80                 1 1 78 79 0=128
Convolution              conv_37                  1 1 79 80 0=128 1=3 4=1 5=1 6=147456
PReLU                    prelu_81                 1 1 80 81 0=128
Convolution              conv_38                  1 1 81 82 0=128 1=3 4=1 5=1 6=147456
PReLU                    prelu_82                 1 1 82 83 0=128
Convolution              conv_39                  1 1 83 84 0=128 1=3 4=1 5=1 6=147456
PReLU                    prelu_83                 1 1 84 85 0=128
BinaryOp                 add_3                    2 1 85 68 86
Deconvolution            deconv_61                1 1 86 flow1 0=5 1=4 3=2 4=1 5=1 6=10240
Interp                   upsample_13              1 1 flow1 88 0=2 1=8.000000e+00 2=8.000000e+00
Split                    splitncnn_8              1 2 88 89 90
Crop                     slice_108                1 1 90 91 -23309=1,0 -23310=1,4 -23311=1,0
Eltwise                  add_5                    2 1 48 91 93 0=1 -23301=2,1.000000e+00,8.000000e+00
Split                    splitncnn_9              1 4 93 94 95 96 97
Crop                     slice_109                1 1 89 98 -23309=1,4 -23310=1,5 -23311=1,0
BinaryOp                 add_6                    2 1 60 98 99
Split                    splitncnn_10             1 2 99 100 101
Interp                   upsample_14              1 1 95 102 0=2 1=5.000000e-01 2=5.000000e-01
BinaryOp                 mul_7                    1 1 102 103 0=2 1=1 2=5.000000e-01
Crop                     slice_110                1 1 97 104 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                warp_3                   2 1 10 104 105
Crop                     slice_111                1 1 96 106 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                warp_2                   2 1 4 106 107
Concat                   cat_3                    4 1 107 105 15 100 108
Interp                   upsample_15              1 1 108 109 0=2 1=5.000000e-01 2=5.000000e-01
Concat                   cat_4                    2 1 109 103 110
Convolution              conv_40                  1 1 110 111 0=48 1=3 3=2 4=1 5=1 6=5184
PReLU                    prelu_84                 1 1 111 112 0=48
Convolution              conv_41                  1 1 112 113 0=96 1=3 3=2 4=1 5=1 6=41472
PReLU                    prelu_85                 1 1 113 114 0=96
Split                    splitncnn_11             1 2 114 115 116
Convolution              conv_42                  1 1 116 117 0=96 1=3 4=1 5=1 6=82944
PReLU                    prelu_86                 1 1 117 118 0=96
Convolution              conv_43                  1 1 118 119 0=96 1=3 4=1 5=1 6=82944
PReLU                    prelu_87                 1 1 119 120 0=96
Convolution              conv_44                  1 1 120 121 0=96 1=3 4=1 5=1 6=82944
PReLU                    prelu_88                 1 1 121 122 0=96
Convolution              conv_45                  1 1 122 123 0=96 1=3 4=1 5=1 6=82944
PReLU                    prelu_89                 1 1 123 124 0=96
Convolution              conv_46                  1 1 124 125 0=96 1=3 4=1 5=1 6=82944
PReLU                    prelu_90                 1 1 125 126 0=96
Convolution              conv_47                  1 1 126 127 0=96 1=3 4=1 5=1 6=82944
PReLU                    prelu_91                 1 1 127 128 0=96
Convolution              conv_48                  1 1 128 129 0=96 1=3 4=1 5=1 6=82944
PReLU                    prelu_92                 1 1 129 130 0=96
Convolution              conv_49                  1 1 130 131 0=96 1=3 4=1 5=1 6=82944
PReLU                    prelu_93                 1 1 131 132 0=96
BinaryOp                 add_8                    2 1 132 115 133
Deconvolution            deconv_62                1 1 133 flow2 0=5 1=4 3=2 4=1 5=1 6=7680
Interp                   upsample_16              1 1 flow2 135 0=2 1=4.000000e+00 2=4.000000e+00
Split                    splitncnn_12             1 2 135 136 137
Crop                     slice_112                1 1 137 138 -23309=1,0 -23310=1,4 -23311=1,0
Eltwise                  add_10                   2 1 94 138 140 0=1 -23301=2,1.000000e+00,4.000000e+00
Split                    splitncnn_13             1 4 140 141 142 143 144
Crop                     slice_113                1 1 136 145 -23309=1,4 -23310=1,5 -23311=1,0
BinaryOp                 add_11                   2 1 101 145 146
Split                    splitncnn_14             1 2 146 147 148
Crop                     slice_114                1 1 144 149 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                warp_5                   2 1 9 149 150
Crop                     slice_115                1 1 143 151 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                warp_4                   2 1 3 151 152
Concat                   cat_5                    4 1 152 150 16 147 153
Interp                   upsample_18              1 1 153 154 0=2
Interp                   upsample_17              1 1 142 155 0=2
Concat                   cat_6                    2 1 154 155 156
Convolution              conv_50                  1 1 156 157 0=32 1=3 3=2 4=1 5=1 6=3456
PReLU                    prelu_94                 1 1 157 158 0=32
Convolution              conv_51                  1 1 158 159 0=64 1=3 3=2 4=1 5=1 6=18432
PReLU                    prelu_95                 1 1 159 160 0=64
Split                    splitncnn_15             1 2 160 161 162
Convolution              conv_52                  1 1 162 163 0=64 1=3 4=1 5=1 6=36864
PReLU                    prelu_96                 1 1 163 164 0=64
Convolution              conv_53                  1 1 164 165 0=64 1=3 4=1 5=1 6=36864
PReLU                    prelu_97                 1 1 165 166 0=64
Convolution              conv_54                  1 1 166 167 0=64 1=3 4=1 5=1 6=36864
PReLU                    prelu_98                 1 1 167 168 0=64
Convolution              conv_55                  1 1 168 169 0=64 1=3 4=1 5=1 6=36864
PReLU                    prelu_99                 1 1 169 170 0=64
Convolution              conv_56                  1 1 170 171 0=64 1=3 4=1 5=1 6=36864
PReLU                    prelu_100                1 1 171 172 0=64
Convolution              conv_57                  1 1 172 173 0=64 1=3 4=1 5=1 6=36864
PReLU                    prelu_101                1 1 173 174 0=64
Convolution              conv_58                  1 1 174 175 0=64 1=3 4=1 5=1 6=36864
PReLU                    prelu_102                1 1 175 176 0=64
Convolution              conv_59                  1 1 176 177 0=64 1=3 4=1 5=1 6=36864
PReLU                    prelu_103                1 1 177 178 0=64
BinaryOp                 add_12                   2 1 178 161 179
Deconvolution            deconv_63                1 1 179 flow3 0=5 1=4 3=2 4=1 5=1 6=5120
Interp                   upsample_19              1 1 flow3 181 0=2 1=2.000000e+00 2=2.000000e+00
Split                    splitncnn_16             1 2 181 182 183
Crop                     slice_116                1 1 183 184 -23309=1,0 -23310=1,4 -23311=1,0
Eltwise                  add_14                   2 1 141 184 186 0=1 -23301=2,1.000000e+00,2.000000e+00
Split                    splitncnn_17             1 2 186 187 188
Crop                     slice_117                1 1 182 189 -23309=1,4 -23310=1,5 -23311=1,0
BinaryOp                 add_15                   2 1 148 189 190
Sigmoid                  sigmoid_8                1 1 190 191
Split                    splitncnn_18             1 2 191 192 193
BinaryOp                 sub_16                   1 1 192 194 0=7 1=1 2=1.000000e+00
Crop                     slice_119                1 1 187 195 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                warp_6                   2 1 8 195 196
BinaryOp                 mul_17                   2 1 196 194 197 0=2
Crop                     slice_118                1 1 188 198 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                warp_7                   2 1 2 198 199
BinaryOp                 mul_18                   2 1 199 193 200 0=2
BinaryOp                 add_19                   2 1 200 197 out0
